
  [
    {
      "id": 1,
      "nombre": "Esqueixada",
      "vegano": false,
      "descripcion": "Ensalada de bacalao desmigado, tomate, cebolla y pimiento rojo, aderezada con aceite de oliva.",
      "preparacion": "1. Desalar el bacalao y desmigarlo en trozos pequeños. 2. Cortar el tomate, la cebolla y el pimiento en rodajas finas. 3. Mezclar todos los ingredientes en un bol grande. 4. Aliñar con aceite de oliva y sal al gusto."
    },
    {
      "id": 2,
      "nombre": "Samfaina",
      "vegano": true,
      "descripcion": "Guiso de verduras con tomate, berenjena, calabacín, cebolla y pimiento rojo.",
      "preparacion": "1. Picar todas las verduras en trozos pequeños. 2. Sofreír la cebolla en aceite de oliva hasta que esté transparente. 3. Agregar el resto de las verduras y cocinar a fuego lento hasta que estén tiernas. 4. Servir caliente."
    },
    {
      "id": 3,
      "nombre": "Escudella i carn d'olla",
      "vegano": false,
      "descripcion": "Cocido catalán hecho con sopa, verduras, carne y embutidos.",
      "preparacion": "1. Cocinar las carnes en una olla grande con agua durante varias horas. 2. Agregar las verduras y cocinar hasta que estén tiernas. 3. Cocinar los fideos por separado en caldo de la olla. 4. Servir la sopa con los fideos y las carnes y verduras en un plato aparte."
    },
    {
      "id": 4,
      "nombre": "Coca de recapte",
      "vegano": true,
      "descripcion": "Tarta salada hecha con masa de pan y cubierta con escalivada, tomate y aceitunas.",
      "preparacion": "1. Preparar la masa de pan y estirarla sobre una bandeja de horno. 2. Cubrir la masa con las verduras asadas. 3. Hornear hasta que la masa esté dorada y crujiente. 4. Servir caliente o a temperatura ambiente."
    },
    {
      "id": 5,
      "nombre": "Faves a la catalana",
      "vegano": true,
      "descripcion": "Estofado de habas con cebolla, ajo, tomate y hierbas aromáticas.",
      "preparacion": "1. Cocinar las habas en agua con sal hasta que estén tiernas. 2. Sofreír la cebolla y el ajo en aceite de oliva hasta que estén dorados. 3. Agregar el tomate y las hierbas aromáticas y cocinar unos minutos más. 4. Incorporar las habas cocidas y cocinar todo junto durante unos minutos más. 5. Servir caliente."
    },
    {
      "id": 6,
      "nombre": "Crema Catalana",
      "vegano": false,
      "descripcion": "Postre tradicional hecho con crema pastelera y caramelo en la parte superior.",
      "preparacion": "1. Calentar la leche con la canela y la cáscara de limón. 2. Batir las yemas con el azúcar y la maicena. 3. Mezclar la leche caliente con la mezcla de yemas y azúcar. 4. Cocinar a fuego lento hasta que espese. 5. Verter en cazuelitas y dejar enfriar. 6. Espolvorear azúcar sobre la crema y quemarla con un soplete de cocina."
    },
    {
      "id": 7,
      "nombre": "Xató",
      "vegano": false,
      "descripcion": "Ensalada de escarola con bacalao desmigado, atún, anchoas, olivas y salsa romesco.",
      "preparacion": "1. Lavar y cortar la escarola en trozos grandes. 2. Mezclar la escarola con las aceitunas negras y el pan tostado en un bol grande. 3. Aliñar con la salsa romesco y, si se desea, añadir cebolla cortada en rodajas finas."
    },
    {
      "id": 8,
      "nombre": "Canelons",
      "vegano": false,
      "descripcion": "Pasta rellena con bechamel, espinacas, piñones y pasas, cubierta con salsa de tomate.",
      "preparacion": "1. Cocinar la pasta para canelones según las instrucciones del paquete. 2. Preparar un relleno con las espinacas, los piñones y las pasas. 3. Rellenar los canelones con esta mezcla. 4. Cubrir los canelones con la salsa de tomate y hornear hasta que estén dorados."
    },
    {
      "id": 9,
      "nombre": "Pa amb tomàquet",
      "vegano": true,
      "descripcion": "Pan con tomate, aceite de oliva, ajo y sal.",
      "preparacion": "1. Tostar rebanadas de pan. 2. Frotar las rebanadas de pan con ajo crudo. 3. Frotar las rebanadas de pan con tomate. 4. Rocíar con aceite de oliva y espolvorear con sal."
    }
    
    ]



